package days03;

public class Ex05 {

	public static void main(String[] args) {
		
		/*
		 * 1.연산자(operator)
		 *    ㄱ. 정의 : 연산을 수행하는 기호
		 *        예) + - * / ; [] () 등등
		 * 2.피연산자(operand)
		 *    ㄱ. 연산자의 처리(작업)대상
		 *    ㄴ. 피연산자(항)의 갯수 따라서 연산자를 구분
		 *         1개 : 단항연산자 
		 *         2개 : 이항연산자     3 + 4 처럼 3과 4 두개의 대상자
		 *         3개 : 삼항연산자
		 * 3.식,수식,표현식(expression)
		 *    ㄱ. 연산자와 피연산자를 조합하여 표현한 것.
		 *        예) 3 + 4      
		 *        예) !4
		 *        예) 4>3
		 * 4.연산자의 종류 (기능 따라)
		 *    ㄱ. 산술연산자 + - * / /                   //Ex05_02.java
		 *    ㄴ. 비교연산자 > < >= <= == !=    //Ex05_03.java
		 *    ㄷ. 논리연산자                                //Ex05_04.java
		 *    ㄹ. 대입연산자
		 *    ㅁ. 기타
		 */
		
	}//main

}//class
