package days16;
/**
 * @author 송해영
 * @date 2023. 8. 3. - 오후 12:14:33
 * @subject [인터페이스(interface)]
 * @content
 */
public class Ex07 {

	public static void main(String[] args) {

		/*
		 * 1. 자바의 자료형
		 * 		기본형 8가지
		 * 		참조형 - 배열, 클래스(String도 클래스), 인터페이스
		 * 2. 변수 선언
		 * 		인터페이스 객체;
		 * 		클래스 객체;
		 * 		배열 [] 배열명;
		 * 3. 일종의 추상클래스이다.
		 * 4. 차이점? 필드 선언이 하나도 되어있지 않다.
		 * 				 일반적인 메서드 선언이 하나도 없음
		 * 		-> 상수만 선언 가능, 추상메서드만 선언할 수 있음.
		 * 			        +
		 * 			 JDK 1.8부터 두가지 추가
		 * 			   1) static 메서드 사용
		 * 			   2) default 메서드 사용
		 * 5. 인터페이스 끼리 상속이 가능하다.
		 * 		extends 사용 가능
		 * 6. 인터페이스를 사용하면 다중 상속이 가능하다.
		 * 7. 인터페이스를 구현할 때는 implement 키워드를 사용해서 클래스를 선언한다.
		 * 8. 인터페이스 안의 필드는 상수만
		 * 		public static final 키워드가 필드 앞에 붙어야함
		 * 		public abstract 키워드가 메서드 앞에 붙어야함 : 인터페이스 안의 메서드는 추상메서드이기 때문에 
		 * 		
		 * 
		 * 
		 * 
		 * */
	
	
	}//main

}//class
